{
    "The WaterHole": {
        "Name": "The WaterHole",
        "Biome": "Savannah",
        "Description": "You arrive at a dried-up waterhole surrounded by parched land. A small group of animals anxiously waits for water to return.",
        "Quest": {
            "QuestionPromt": "What is the most effective way to ensure consistent access to water for wildlife and local communities in the savannah?",
            "Choices": {
                "1": {
                    "Description": "Build sustainable water storage systems like dams and reservoirs.",
                    "Correct": true
                },
                "2": {
                    "Description": "Pray for rainfall.",
                    "Correct": false
                },
                "3": {
                    "Description": "Redirect rivers for farming, ignoring the needs of wildlife.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Local Ranger",
            "Dialogue": "This waterhole used to be full of life, but the rains have been unreliable lately. Both animals and people need a dependable water source, but it has to work even during the driest seasons. What could help us achieve that?"
        }
    },
    "Trees": {
        "Name": "Trees",
        "Biome": "Savannah",
        "Description": "You find yourself under a cluster of acacia trees. Burnt patches on the ground indicate recent wildfires.",
        "Quest": {
            "QuestionPromt": "What is the most effective strategy to prevent wildfires in the savannah?",
            "Choices": {
                "1": {
                    "Description": "Conduct controlled burns to manage dry vegetation.",
                    "Correct": true
                },
                "2": {
                    "Description": "Avoid clearing dry grass or debris.",
                    "Correct": false
                },
                "3": {
                    "Description": "Ban all fires, including for essential activities like cooking.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Fire Expert",
            "Dialogue": "You see those blackened patches? Wildfires are a big threat here, but leaving dry grass lying around makes things worse. Some fires, though, can actually help if they're controlled. Can you figure out the best way to manage this?"
        }
    },
    "Sunset Ridge": {
        "Name": "Sunset Ridge",
        "Biome": "Savannah",
        "Description": "From the ridge, you see a herd of zebras grazing below. A lioness lurks in the tall grass.",
        "Quest": {
            "QuestionPromt": "Zebras' stripes are not just for decoration. What purpose do they serve?",
            "Choices": {
                "1": {
                    "Description": "To confuse predators and regulate body temperature.",
                    "Correct": true
                },
                "2": {
                    "Description": "To climb trees.",
                    "Correct": false
                },
                "3": {
                    "Description": "To scare other zebras.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Wildlife Biologist",
            "Dialogue": "Look at those zebras grazing down there. Their stripes aren't just beautiful; they serve a practical purpose. They help with survival in ways that might surprise you. Do you know how?"
        }
    },
    "Hidden WaterHole": {
        "Name": "Hidden WaterHole",
        "Biome": "Forest",
        "Description": "You find a secluded waterhole in the dense forest. Trash is scattered around, threatening the delicate ecosystem.",
        "Quest": {
            "QuestionPromt": "What should you do to protect the waterhole and the animals that rely on it?",
            "Choices": {
                "1": {
                    "Description": "Clean up the trash to keep the water safe for animals.",
                    "Correct": true
                },
                "2": {
                    "Description": "Leave the trash to avoid disturbing the area.",
                    "Correct": false
                },
                "3": {
                    "Description": "Add signs to attract more visitors to the waterhole.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Conservationist",
            "Dialogue": "This secluded waterhole is a lifeline for animals, but the trash people leave behind is poisoning the water. Cleaning up can make a huge difference. What do you think is the right thing to do here?"
        }
    },
    "The Trees": {
        "Name": "The Trees",
        "Biome": "Forest",
        "Description": "You stand in a part of the forest where many trees have been cut down. The soil is eroding, and wildlife is scarce.",
        "Quest": {
            "QuestionPromt": "What is the best course of action to restore this part of the forest?",
            "Choices": {
                "1": {
                    "Description": "Plant native trees to replace the ones that were cut down.",
                    "Correct": true
                },
                "2": {
                    "Description": "Build a road through the forest for easier access.",
                    "Correct": false
                },
                "3": {
                    "Description": "Clear the remaining trees for development.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Forest Guardian",
            "Dialogue": "This area has suffered greatly from deforestation. The soil is exposed, and animals have nowhere to go. Planting the right trees could restore the balance here. What action will bring this forest back to life?"
        }
    },
    "Forgotten Path": {
        "Name": "Forgotten Path",
        "Biome": "Forest",
        "Description": "As you walk along a trail, you notice fewer animals and an eerie silence.",
        "Quest": {
            "QuestionPromt": "Why might animals be disappearing from this area?",
            "Choices": {
                "1": {
                    "Description": "Deforestation is destroying their habitats.",
                    "Correct": true
                },
                "2": {
                    "Description": "The animals are migrating for better scenery.",
                    "Correct": false
                },
                "3": {
                    "Description": "Animals are becoming less active because of cooler temperatures.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Elder Tracker",
            "Dialogue": "This path used to teem with life, but it’s been neglected and damaged over the years. Nature can heal if we take the right steps. What would you do to bring it back?"
        }
    },
    "Shallow Waters": {
        "Name": "Shallow Waters",
        "Biome": "Beach",
        "Description": "You step into a serene tidepool, but something catches your eye—a fish tangled in a plastic bag struggles to swim.",
        "Quest": {
            "QuestionPromt": "What should you do to help protect marine life like this fish?",
            "Choices": {
                "1": {
                    "Description": "Carefully remove the plastic and dispose of it properly.",
                    "Correct": true
                },
                "2": {
                    "Description": "Leave it alone; nature will resolve the issue.",
                    "Correct": false
                },
                "3": {
                    "Description": "Use the fish to attract predators as part of the food chain.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Marine Biologist",
            "Dialogue": "Plastic waste in our oceans can be deadly for marine creatures. By removing it carefully and disposing of it properly, we can help protect these vulnerable species. What do you think should be done here?"
        }
    },
    "Sea Turtle NestingSite": {
        "Name": "Sea Turtle NestingSite",
        "Biome": "Beach",
        "Description": "You stumble upon a sea turtle carefully laying its eggs in the sand. Nearby, footprints suggest someone was here recently.",
        "Quest": {
            "QuestionPromt": "How should you handle this delicate situation?",
            "Choices": {
                "1": {
                    "Description": "Mark the nesting site to warn others and ensure the eggs are not disturbed.",
                    "Correct": true
                },
                "2": {
                    "Description": "Take photos from up close for educational purposes.",
                    "Correct": false
                },
                "3": {
                    "Description": "Move the eggs to a safer location.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Beach Ranger",
            "Dialogue": "Sea turtle nests are vulnerable, and even a small disturbance can harm the eggs. We need to make sure this site is protected without causing further stress. What would you do to keep it safe?"
        }
    },
    "Seagull NestingArea": {
        "Name": "Seagull NestingArea",
        "Biome": "Beach",
        "Description": "You find a flock of seagulls pecking at trash scattered near an overflowing bin.",
        "Quest": {
            "QuestionPromt": "What action can reduce harm to wildlife in this scenario?",
            "Choices": {
                "1": {
                    "Description": "Dispose of the trash in a nearby bin and secure the lid.",
                    "Correct": true
                },
                "2": {
                    "Description": "Ignore it; the birds will clean up the area naturally.",
                    "Correct": false
                },
                "3": {
                    "Description": "Scare the seagulls away and leave the trash.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Eco Volunteer",
            "Dialogue": "Seagulls are scavengers, but when trash piles up, it harms them and other animals. Keeping the area clean and properly disposing of trash helps prevent more danger. What do you think we should do here?"
        }
    },
    "TidePools": {
        "Name": "TidePools",
        "Biome": "Beach",
        "Description": "The tidepools shimmer under the sunlight, teeming with small crabs and sea anemones. But you notice some sharp debris hidden in the water.",
        "Quest": {
            "QuestionPromt": "How can you ensure this tidepool remains a safe habitat for marine life?",
            "Choices": {
                "1": {
                    "Description": "Carefully remove sharp objects and ensure no one leaves trash behind.",
                    "Correct": true
                },
                "2": {
                    "Description": "Relocate the animals to another tidepool.",
                    "Correct": false
                },
                "3": {
                    "Description": "Take photos of the debris to document the issue, but leave it as is.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Tidepool Educator",
            "Dialogue": "Tidepools are delicate ecosystems, home to many small creatures. Sharp debris can harm them, and trash only makes things worse. Keeping the habitat clean is essential for their survival. What do you think would be the best way to protect them?"
        }
    },
    "The Barn": {
        "Name": "The Barn",
        "Biome": "Farm",
        "Description": "A cozy barn filled with livestock. However, some animals seem unwell, and you hear distressed sounds.",
        "Quest": {
            "QuestionPromt": "What is the most responsible action to take for the unwell animals?",
            "Choices": {
                "1": {
                    "Description": "Provide clean water, inspect their conditions, and call a vet.",
                    "Correct": true
                },
                "2": {
                    "Description": "Sell the animals to minimize costs.",
                    "Correct": false
                },
                "3": {
                    "Description": "Ignore the issue and hope the animals recover on their own.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Farm Caretaker",
            "Dialogue": "These animals are showing signs of distress—something’s clearly wrong. Ignoring it won’t make it better, and just getting rid of them isn’t the solution. What do you think we should do to make sure they get the right care?"
        }
    },
    "Crop Field": {
        "Name": "Crop Field",
        "Biome": "Farm",
        "Description": "A vast crop field stretches before you, but the soil looks dry and cracked, hinting at years of poor farming practices.",
        "Quest": {
            "QuestionPromt": "How can you restore the health of this soil?",
            "Choices": {
                "1": {
                    "Description": "Use compost and implement crop rotation techniques.",
                    "Correct": true
                },
                "2": {
                    "Description": "Continue using chemical fertilizers for a quick fix.",
                    "Correct": false
                },
                "3": {
                    "Description": "Abandon the field and focus on untouched lands.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Agricultural Specialist",
            "Dialogue": "The soil here is cracked and lifeless, a sign of overuse and neglect. Chemical fixes might seem easy, but they won’t solve the problem long-term. Restoring the soil’s health takes natural methods, like compost and crop rotation. What do you think will work best?"
        }
    },
    "Highway": {
        "Name": "Highway",
        "Biome": "City",
        "Description": "The busy highway is littered with plastic waste, creating a hazard for wildlife and an eyesore for travelers.",
        "Quest": {
            "QuestionPromt": "What action should you take to address this issue?",
            "Choices": {
                "1": {
                    "Description": "Safely collect the waste and dispose of it in a designated area.",
                    "Correct": true
                },
                "2": {
                    "Description": "Ignore the trash; someone else will clean it eventually.",
                    "Correct": false
                },
                "3": {
                    "Description": "Push the trash further away from the road.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "City Worker",
            "Dialogue": "Roadside trash not only pollutes the environment but also endangers animals. Every cleanup effort helps!"
        }
    },
    "Park": {
        "Name": "Park",
        "Biome": "City",
        "Description": "A peaceful park marred by scattered plastic straws and food wrappers left behind by careless visitors.",
        "Quest": {
            "QuestionPromt": "How can you help maintain this park as a safe space for nature and people?",
            "Choices": {
                "1": {
                    "Description": "Organize a cleanup and educate visitors on proper disposal.",
                    "Correct": true
                },
                "2": {
                    "Description": "Avoid the area; the trash is too overwhelming.",
                    "Correct": false
                },
                "3": {
                    "Description": "Blame park authorities and wait for them to act.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "Community Volunteer",
            "Dialogue": "Parks are shared spaces for all living beings. A small effort can make a huge difference!"
        }
    },
    "Bikelane": {
        "Name": "Bikelane",
        "Biome": "City",
        "Description": "Your favorite bikelane",
        "Quest": {
            "QuestionPromt": "You're on your way to school and see shards of glass on the lane. What do you do?",
            "Choices": {
                "1": {
                    "Description": "You prioritize your deck and bike as much around it as possible",
                    "Correct": false
                },
                "2": {
                    "Description": "You kick it further away",
                    "Correct": false
                },
                "3": {
                    "Description": "You put it to the side and contact the authorities",
                    "Correct": true
                }
            },
            "Npc": {
                "Name": "Police Biker",
                "Dialogue": "Whew, I've never seen so many shards of glass laying on the bikelane in one day. I sure hope no animals have stepped on them yet. I better put them aside!"
            }
        }
    },
    "Alley": {
        "Name": "Alley",
        "Biome": "City",
        "Description": "Windy day",
        "Quest": {
            "QuestionPromt": "You see an open trash bag on a windy day. Not only is it attracting rats, but the plastic also flies out.\n What do you do?",
            "Choices": {
                "1": {
                    "Description": "You cover your nose with your hand and say \"Whats that foul smell?!\"",
                    "Correct": false
                },
                "2": {
                    "Description": "You ignore it since you don't want trash juice on you",
                    "Correct": false
                },
                "3": {
                    "Description": "You try to clean up what you can",
                    "Correct": true
                }
            }
        },
        "Npc": {
            "Name": "Concerned Resident",
            "Dialogue": "This alley is becoming a mess with trash flying everywhere and rats showing up. Someone needs to step up and clean it before it gets worse. Can you help?"
        }
    },
    "Pond": {
        "Name": "Pond",
        "Biome": "Farm",
        "Description": "A small pond providing water for animals and crops.",
        "Quest": {
            "QuestionPromt": "The pond is polluted with trash. What will you do?",
            "Choices": {
                "1": {
                    "Description": "Add more water to dilute the pollution.",
                    "Correct": false
                },
                "2": {
                    "Description": "Ignore it, nature will fix itself.",
                    "Correct": false
                },
                "3": {
                    "Description": "Clean the pond and add plants to filter the water.",
                    "Correct": true
                }
            }
        },
        "Npc": {
            "Name": "Marine Biologist",
            "Dialogue": "Hi! Did you know trash on a pond blocks sunlight, stopping plants from making oxygen that pond animals need?"
        }
    },
    "The Stable": {
        "Name": "The Stable",
        "Biome": "Farm",
        "Description": "A stable for horses and other animals. It's peaceful, but something needs attention.",
        "Quest": {
            "QuestionPromt": "The stable floor is dirty, and the animals seem uncomfortable. What will you do?",
            "Choices": {
                "1": {
                    "Description": "Clean the floor and add fresh bedding.",
                    "Correct": true
                },
                "2": {
                    "Description": "Leave it the animals will manage.",
                    "Correct": false
                },
                "3": {
                    "Description": "Move the animals outside permanently.",
                    "Correct": false
                }
            }
        },
        "Npc": {
            "Name": "The Ethologist",
            "Dialogue": "This is where we care for our animals and ensure the farm remains productive and sustainable."
        }
    },
    "Distant Horizon": {
        "Name": "Distant Horizon",
        "Biome": "Forest",
        "Description": "From a high vantage point, you see a vast forest stretching out before you, with a dry riverbed cutting through the landscape. In the distance, a lone deer limps, searching for water.",
        "Quest": {
            "QuestionPromt": "From the distant horizon, you spot a deer limping near a dry riverbed. It seems to be searching for water. What can you do to help animals like this deer survive in a changing environment?",
            "Choices": {
                "1": {
                    "Choice": "Try to guide the deer toward the nearest town for help.",
                    "Correct": false
                },
                "2": {
                    "Choice": "Feed the deer some food you have with you to help it regain strength.",
                    "Correct": false
                },
                "3": {
                    "Choice": "Support efforts to restore water sources, so animals have a place to drink.",
                    "Correct": true
                }
            }
        },
        "Npc": {
            "Name": "The Woodland Keeper",
            "Dialogue": "These animals are deeply affected by the scars of time and human actions, from habitat loss to exploitation, leaving them in need of urgent restoration and care."
        }
    },
    "Lion's Den": {
        "Name": "Lion's Den",
        "Biome": "Savannah",
        "Description": "In the golden grasslands, you spot a lion resting under the shade of an acacia tree. Its powerful presence contrasts with the quiet surroundings, but there's a sense of vulnerability as you notice the lack of prey nearby.",
        "Quest": {
            "QuestionPrompt": "What can be done to help maintain a balanced ecosystem in the savannah, ensuring predators like lions have enough food and the land remains healthy?",
            "Choices": {
                "1": {
                    "Choice": "Support sustainable wildlife management and prevent overhunting of herbivores.",
                    "Correct": true
                },
                "2": {
                    "Choice": "Introduce more predators to control herbivore populations.",
                    "Correct": false
                },
                "3": {
                    "Choice": "Allow uncontrolled hunting to reduce herbivore numbers.",
                    "Correct": false
                }
            },
            "Npc": {
                "Name": "Wildlife Conservationist",
                "Dialogue": "Lions are crucial to the balance of the savannah, but their prey is being overhunted, and the land is suffering. Sustainable practices are the key to maintaining the ecosystem."
            }
        }
    }
}